Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/tribunals_and_investigations/index.html.txt.tmx
Source language: en
Languages: ga

source: Tribunals and investigations - introduction
ga: Binsí agus imscrúduithe - réamhrá

source: Irish law makes provision for a number of different types of investigatory inquiry
ga: Déantar foráil i ndlí na hÉireann do líon saghsanna éagsúla d’fhiosrúchán imscrúdaithe

source: A tribunal of inquiry investigates a specific matter(s) of public importance and submits a report to the Oireachtas setting out its findings of fact
ga: Imscrúdaíonn binse fiosrúcháin ceisteanna ar leith a bhfuil tábhacht phoiblí ag baint leo agus cuireann an binse tuairisc faoi bhráid an Oireachtais a leagann síos na cinntí fíorais

source: Commissions of investigation are a less expensive and speedier method of investigating matters than a tribunal of inquiry
ga: Ní chosnaíonn coimisiúin imscrúdaithe an oiread céanna agus is bealach níos tapúla iad chun saincheisteanna a imscrúdú ná binse fiosraithe

source: Most Read in "Government in Ireland"
ga: Ábhar is mó éilimh i "Rialtas in Éirinn"

source: Fundamental Rights under the Irish Constitution
ga: Bunchearta faoi Bhunreacht na hÉireann
